#ifndef CORE_NT_DEFINITIONS_H
#define CORE_NT_DEFINITIONS_H

#include <ntddk_misc.h>
#include <ntddk_module.h>
//---------------------------------------------------------------------------------------
// versions

typedef struct _OSVERSIONINFOEXW {
    ULONG dwOSVersionInfoSize;
    ULONG dwMajorVersion;
    ULONG dwMinorVersion;
    ULONG dwBuildNumber;
    ULONG dwPlatformId;
    WCHAR  szCSDVersion[ 128 ];     // Maintenance string for PSS usage
    USHORT wServicePackMajor;
    USHORT wServicePackMinor;
    USHORT wSuiteMask;
    UCHAR wProductType;
    UCHAR wReserved;
} OSVERSIONINFOEXW_CORE, 
*POSVERSIONINFOEXW_CORE, 
*LPOSVERSIONINFOEXW_CORE, 
RTL_OSVERSIONINFOEXW_CORE, 
*PRTL_OSVERSIONINFOEXW_CORE;


typedef NTSTATUS
(*RtlGetVersionProc)(
    OUT  POSVERSIONINFOEXW_CORE lpVersionInformation
    );

//---------------------------------------------------------------------------------------
// Hooking supply
//---------------------------------------------------------------------------------------
#define SYSCALL_INDEX(_Function) *(PULONG)((PUCHAR)_Function+1)

typedef NTSTATUS (NTAPI *NTPROC) ();
typedef NTPROC *PNTPROC;
typedef struct _SYSTEM_SERVICE_TABLE
{
    /*000*/ PNTPROC ServiceTable;           // array of entry points
    /*004*/ ULONG *  CounterTable;           // array of usage counters
    /*008*/ ULONG   ServiceLimit;           // number of table entries
    /*00C*/ UCHAR *  ArgumentTable;          // array of byte counts
    /*010*/ 
}SYSTEM_SERVICE_TABLE, * PSYSTEM_SERVICE_TABLE,    **PPSYSTEM_SERVICE_TABLE;

typedef struct _SERVICE_DESCRIPTOR_TABLE
{
    /*000*/ SYSTEM_SERVICE_TABLE ntoskrnl;  // ntoskrnl.exe (native api)
    /*010*/ SYSTEM_SERVICE_TABLE win32k;    // win32k.sys   (gdi/user)
    /*020*/ SYSTEM_SERVICE_TABLE Table3;    // not used
    /*030*/ SYSTEM_SERVICE_TABLE Table4;    // not used
    /*040*/ 
}SERVICE_DESCRIPTOR_TABLE, * PSERVICE_DESCRIPTOR_TABLE,    **PPSERVICE_DESCRIPTOR_TABLE;

//---------------------------------------------------------------------------------------
// TOKENS
//---------------------------------------------------------------------------------------
NTSTATUS
ZwOpenProcessToken(
                   HANDLE Token,
                   ULONG TokenRights,
                   PVOID pointHandle
                   );

NTSTATUS 
ZwOpenThreadToken(IN HANDLE ThreadHandle, 
                  IN ACCESS_MASK DesiredAccess, 
                  IN BOOLEAN OpenAsSelf, 
                  OUT PHANDLE TokenHandle);

NTSTATUS
ZwQueryInformationToken(
                        HANDLE hToken,
                        TOKEN_INFORMATION_CLASS TokenInfoClass,
                        PVOID TokenInfoBuffer,
                        ULONG TokenInfoBufferLength,
                        PULONG BytesReturned
